In [6]:
import env
import numpy as np
import pandas as pd
from pydataset import data

In [7]:
def get_db_url(user,password,host,database):
    return f'mysql+pymysql://{user}:{password}@{host}/{database}'

In [8]:
url = get_db_url(env.user,env.password,env.host,'employees')

In [9]:
query = 'select * from employees limit 10'

In [ ]:
url_typo = get_db_url(user,password,host,'employeess')
url_typo

'mysql+pymysql://robinson_2289:YYxwAT9m2guld6bsEHpjenVRfObPzMdC@data.codeup.com/employeess'

In [11]:
df = pd.read_sql(query,url_typo)

NameError: name 'url_typo' is not defined

In [ ]:
query_typo= 'select * from employees limit 10z'

In [12]:
df = pd.read_sql(query_typo,url)

NameError: name 'query_typo' is not defined

In [13]:
titles_query = 'select * from titles'

In [14]:
employees_df = pd.read_sql(query,url)
titles_df = pd.read_sql(titles_query,url)
titles_df

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

In [16]:
employees_df.shape

(10, 6)

In [17]:
titles_df.shape

(443308, 4)

In [18]:
len(titles_df.title.unique())

7

In [19]:
employees_df.describe()

            emp_no
count     10.00000
mean   10005.50000
std        3.02765
min    10001.00000
25%    10003.25000
50%    10005.50000
75%    10007.75000
max    10010.00000

In [20]:
titles_df.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

In [21]:
titles_df['to_date'].min()

datetime.date(1985, 3, 1)

In [22]:
titles_df['to_date'].max()

datetime.date(9999, 1, 1)

In [23]:
recent_date = 'select * from titles where to_date < now()'

In [24]:
recent_date_df = pd.read_sql(recent_date,url)

recent_date_df['to_date'].max()

datetime.date(2002, 8, 1)

### Exercise 2
1. Copy the users and roles DataFrames from the examples above.

In [25]:
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [26]:
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

2. What is the result of using a right join on the DataFrames?

In [27]:
users.merge(roles, left_on='id', right_on='id',how='right',indicator=True)

   id name_x  role_id     name_y _merge
0   1    bob      1.0      admin   both
1   2    joe      2.0     author   both
2   3  sally      3.0   reviewer   both
3   4   adam      3.0  commenter   both

3. What is the result of using an outer join on the DataFrames?

In [28]:
users.merge(roles, left_on='id', right_on='id',how='outer',indicator=True)

   id name_x  role_id     name_y     _merge
0   1    bob      1.0      admin       both
1   2    joe      2.0     author       both
2   3  sally      3.0   reviewer       both
3   4   adam      3.0  commenter       both
4   5   jane      NaN        NaN  left_only
5   6   mike      NaN        NaN  left_only

4. What happens if you drop the foreign keys from the DataFrames and try to merge them?

In [29]:
drop_roles = roles.drop(columns='id')
drop_roles

        name
0      admin
1     author
2   reviewer
3  commenter

In [32]:
drop_users = drop_roles.merge(drop_roles, left_on='name', right_on='name',how='outer',indicator=True)
# still able to merge, with or without foreign key

5. Load the mpg dataset from PyDataset.

In [34]:
mpg = data('mpg')
data('mpg', show_doc=True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

7. How many rows and columns are in the dataset?

In [35]:
mpg.shape

(234, 11)

8. Check out your column names and perform any cleanup you may want on them.

In [36]:
mpg.columns
mpg = mpg.rename(columns={'displ':'dispacement'})

9. Display the summary statistics for the dataset.

In [37]:
mpg.describe()

       dispacement         year         cyl         cty         hwy
count   234.000000   234.000000  234.000000  234.000000  234.000000
mean      3.471795  2003.500000    5.888889   16.858974   23.440171
std       1.291959     4.509646    1.611534    4.255946    5.954643
min       1.600000  1999.000000    4.000000    9.000000   12.000000
25%       2.400000  1999.000000    4.000000   14.000000   18.000000
50%       3.300000  2003.500000    6.000000   17.000000   24.000000
75%       4.600000  2008.000000    8.000000   19.000000   27.000000
max       7.000000  2008.000000    8.000000   35.000000   44.000000

In [38]:
mpg

,manufacturer,model,dispacement,year,cyl,trans,drv,cty,hwy,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

10. How many different manufacturers are there?

In [39]:
mpg['manufacturer'].nunique()

15

11. How many different models are there?

In [40]:
mpg['model'].nunique()
#11

38

12. Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

In [41]:
mpg['mileage_difference'] = mpg['hwy'] - mpg['cty']
mpg

,manufacturer,model,dispacement,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10
...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9

13. Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

In [42]:
mpg['average_mileage'] = (mpg['cty'] + mpg['hwy']) / 2
mpg

,manufacturer,model,dispacement,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5

14. Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

In [43]:
mpg['is_auto'] = np.where(mpg['trans'].str.contains('auto'),True,False)
mpg

,manufacturer,model,dispacement,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage,is_auto
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5,True
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0,False
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0,True
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0,False
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5,True

15. Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

In [44]:
manu_avgmile = pd.concat([mpg['manufacturer'], mpg['average_mileage']], axis=1)

manu_avgmile.groupby(['manufacturer'])

In [45]:
highest_avg_miles = manu_avgmile.groupby(['manufacturer'])['average_mileage'].mean().sort_values(ascending=False)
highest_avg_miles

manufacturer
honda         28.500000
volkswagen    25.074074
hyundai       22.750000
subaru        22.428571
audi          22.027778
toyota        21.720588
pontiac       21.700000
nissan        21.346154
chevrolet     18.447368
ford          16.680000
mercury       15.625000
jeep          15.562500
dodge         15.540541
lincoln       14.166667
land rover    14.000000
Name: average_mileage, dtype: float64

16. Do automatic or manual cars have better miles per gallon?

In [46]:
mpg.groupby('is_auto')['average_mileage'].mean()
# They do not

is_auto
False    22.227273
True     19.130573
Name: average_mileage, dtype: float64

### Exercises III
1. Use your get_db_url function to help you explore the data from the chipotle database.

In [48]:
url_chipotle = get_db_url(env.user,env.password,env.host,'chipotle')
query_chipotle = 'select * from orders'
chipotle = pd.read_sql(query_chipotle,url_chipotle)
chipotle

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98
...,...,...,...,...,...,...
4617,4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour Cream, Cheese, Lettuce, Guacamole]]",$11.75
4618,4619,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese, Lettuce, Guacamole]]",$11.75
4619,4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Guacamole, Lettuce]]",$11.25
4620,4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettuce]]",$8.75
4621,4622,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Lettuce]]",$8.75

2. What is the total price for each order?

In [49]:
chipotle['item_price'] = chipotle['item_price'].str.replace(',','')
chipotle['item_price'] = chipotle['item_price'].str.replace('$','')
chipotle['item_price'] = chipotle['item_price'].astype('float')

In [51]:
chipotle.groupby('order_id')['item_price'].sum()

order_id
1       11.56
2       16.98
3       12.67
4       21.00
5       13.70
        ...
1830    23.00
1831    12.90
1832    13.20
1833    23.50
1834    28.75
Name: item_price, Length: 1834, dtype: float64

3. What are the most popular 3 items?

In [52]:
pd.crosstab(chipotle.item_name,chipotle.quantity,margins=True)
#726 Chicken bowls, 553 Chicken burritos, 479 Chips and guac

quantity,1,2,3,4,5,7,8,10,15,All
item_name,,,,,,,,,,
6 Pack Soft Drink,53,1,0,0,0,0,0,0,0,54
Barbacoa Bowl,66,0,0,0,0,0,0,0,0,66
Barbacoa Burrito,91,0,0,0,0,0,0,0,0,91
Barbacoa Crispy Tacos,10,1,0,0,0,0,0,0,0,11
Barbacoa Salad Bowl,10,0,0,0,0,0,0,0,0,10
Barbacoa Soft Tacos,25,0,0,0,0,0,0,0,0,25
Bottled Water,139,12,6,2,1,1,0,1,0,162
Bowl,1,0,1,0,0,0,0,0,0,2
Burrito,6,0,0,0,0,0,0,0,0,6
Canned Soda,84,19,0,1,0,0,0,0,0,104
Canned Soft Drink,264,27,7,3,0,0,0,0,0,301
Carnitas Bowl,66,1,1,0,0,0,0,0,0,68
Carnitas Burrito,58,1,0,0,0,0,0,0,0,59
Carnitas Crispy Tacos,6,1,0,0,0,0,0,0,0,7
Carnitas Salad,1,0,0,0,0,0,0,0,0,1
Carnitas Salad Bowl,6,0,0,0,0,0,0,0,0,6
Carnitas Soft Tacos,40,0,0,0,0,0,0,0,0,40
Chicken Bowl,693,31,2,0,0,0,0,0,0,726
Chicken Burrito,521,28,2,2,0,0,0,0,0,553
Chicken Crispy Tacos,44,3,0,0,0,0,0,0,0,47
Chicken Salad,9,0,0,0,0,0,0,0,0,9
Chicken Salad Bowl,97,13,0,0,0,0,0,0,0,110
Chicken Soft Tacos,110,5,0,0,0,0,0,0,0,115
Chips,193,17,1,0,0,0,0,0,0,211
Chips and Fresh Tomato Salsa,105,3,0,1,0,0,0,0,1,110
Chips and Guacamole,455,22,1,1,0,0,0,0,0,479
Chips and Mild Fresh Tomato Salsa,1,0,0,0,0,0,0,0,0,1
Chips and Roasted Chili Corn Salsa,21,1,0,0,0,0,0,0,0,22
Chips and Roasted Chili-Corn Salsa,18,0,0,0,0,0,0,0,0,18
Chips and Tomatillo Green Chili Salsa,41,2,0,0,0,0,0,0,0,43
Chips and Tomatillo Red Chili Salsa,46,2,0,0,0,0,0,0,0,48
Chips and Tomatillo-Green Chili Salsa,29,2,0,0,0,0,0,0,0,31
Chips and Tomatillo-Red Chili Salsa,17,1,2,0,0,0,0,0,0,20
Crispy Tacos,2,0,0,0,0,0,0,0,0,2
Izze,20,0,0,0,0,0,0,0,0,20
Nantucket Nectar,25,2,0,0,0,0,0,0,0,27
Salad,2,0,0,0,0,0,0,0,0,2
Side of Chips,99,0,1,0,0,0,1,0,0,101
Steak Bowl,202,8,1,0,0,0,0,0,0,211
Steak Burrito,352,14,2,0,0,0,0,0,0,368
Steak Crispy Tacos,34,1,0,0,0,0,0,0,0,35
Steak Salad,4,0,0,0,0,0,0,0,0,4
Steak Salad Bowl,27,2,0,0,0,0,0,0,0,29
Steak Soft Tacos,54,1,0,0,0,0,0,0,0,55
Veggie Bowl,83,2,0,0,0,0,0,0,0,85
Veggie Burrito,94,0,1,0,0,0,0,0,0,95
Veggie Crispy Tacos,1,0,0,0,0,0,0,0,0,1
Veggie Salad,6,0,0,0,0,0,0,0,0,6
Veggie Salad Bowl,18,0,0,0,0,0,0,0,0,18
Veggie Soft Tacos,6,1,0,0,0,0,0,0,0,7
All,4355,224,28,10,1,1,1,1,1,4622

4. Which item has produced the most revenue?

In [53]:
#chipotle.pivot_table(index='quantity',columns='item_name',values='item_price')

In [54]:
chipotle.groupby('item_name')['item_price'].sum().sort_values(ascending=False).head()
#chicken bowl

item_name
Chicken Bowl           7342.73
Chicken Burrito        5575.82
Steak Burrito          3851.43
Steak Bowl             2260.19
Chips and Guacamole    2201.04
Name: item_price, dtype: float64

5. Join the employees and titles DataFrames together.

In [56]:
url_employees = get_db_url(env.user,env.password,env.host,'employees')
query_employees = 'select * from employees'
query_titles = 'select * from titles'
employees = pd.read_sql(query_employees,url_employees)
titles = pd.read_sql(query_titles,url_employees)

In [58]:
employees.sample(3)
titles.sample(3)

        emp_no         title   from_date     to_date
215710  245810  Senior Staff  1986-03-08  9999-01-01
208995  241262      Engineer  1993-02-19  2001-02-19
284996  292740      Engineer  1988-03-03  1996-03-03

In [59]:
emp_titles = employees.merge(titles, how='inner', on='emp_no')
emp_titles

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1996-08-03,9999-01-01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer,1995-12-03,9999-01-01
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Engineer,1986-12-01,1995-12-01
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer,1995-12-01,9999-01-01
...,...,...,...,...,...,...,...,...,...
443303,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,Engineer,1987-08-30,1992-08-29
443304,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,Senior Engineer,1992-08-29,9999-01-01
443305,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Senior Staff,1998-12-27,9999-01-01
443306,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Staff,1993-12-27,1998-12-27
443307,499999,1958-05-01,Sachin,Tsukuda,M,1997-11-30,Engineer,1997-11-30,9999-01-01

6. For each title, find the hire date of the employee that was hired most recently with that title.

In [60]:
emp_titles.groupby('title')['from_date'].max()

title
Assistant Engineer    2000-02-01
Engineer              2002-08-01
Manager               1996-08-30
Senior Engineer       2002-08-01
Senior Staff          2002-08-01
Staff                 2000-02-01
Technique Leader      2000-02-01
Name: from_date, dtype: object

7. Write the code necessary to create a cross tabulation of the number of titles by department. (Hint: this will involve combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)

In [63]:
query_departments = 'select * from departments'
query_deptemp = 'select dept_no, emp_no from dept_emp'
dp = pd.read_sql(query_departments, url_employees)
dpe = pd.read_sql(query_deptemp, url_employees)
dp

  dept_no           dept_name
0    d009    Customer Service
1    d005         Development
2    d002             Finance
3    d003     Human Resources
4    d001           Marketing
5    d004          Production
6    d006  Quality Management
7    d008            Research
8    d007               Sales

In [64]:
demp_titles = emp_titles.merge(dpe, how='right', on='emp_no')
demp_titles

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date,dept_no
0,10017,1958-07-06,Cristinel,Bouloucos,F,1993-08-03,Senior Staff,2000-08-03,9999-01-01,d001
1,10017,1958-07-06,Cristinel,Bouloucos,F,1993-08-03,Staff,1993-08-03,2000-08-03,d001
2,10055,1956-06-06,Georgy,Dredge,M,1992-04-27,Staff,1992-04-27,1995-07-22,d001
3,10058,1954-10-01,Berhard,McFarlin,M,1987-04-13,Senior Staff,1988-04-25,9999-01-01,d001
4,10108,1952-04-07,Lunjin,Giveon,M,1986-10-02,Staff,1999-03-20,2001-10-20,d001
...,...,...,...,...,...,...,...,...,...,...
489898,499978,1960-03-29,Chiranjit,Kuzuoka,M,1990-05-24,Staff,1996-07-09,1997-12-14,d009
489899,499982,1954-08-25,Mohammed,Pleszkun,M,1986-02-21,Staff,1999-04-08,2000-05-16,d009
489900,499983,1955-08-29,Uri,Juneja,F,1989-08-28,Senior Staff,2001-07-14,9999-01-01,d009
489901,499983,1955-08-29,Uri,Juneja,F,1989-08-28,Staff,1995-07-15,2001-07-14,d009
489902,499991,1962-02-26,Pohua,Sichman,F,1989-01-12,Staff,1997-02-11,9999-01-01,d009

In [65]:
pd.crosstab(index=dp.dept_name,columns=emp_titles.title)

title               Engineer  Senior Engineer  Senior Staff  Staff
dept_name
Customer Service           0                1             0      0
Development                0                0             0      1
Finance                    0                1             0      0
Human Resources            1                0             0      0
Marketing                  0                1             0      0
Production                 0                0             1      0
Quality Management         0                0             0      1
Research                   0                1             0      0
Sales                      0                0             1      0